const WISHES = [
  ["龙龙致上", "时节如流，冬雪落满山海。岁末将至，新年踏歌而来。纵使人潮汹涌，光阴似箭，亦盼山海广阔，岁月风平。"],
  ["龙龙致上", "愿你笑魇如花，愿你眉间无霜；愿你清澈明朗，愿你活色生香；愿你年年岁岁，月月节节攀高；愿你无风无雨，愿你平安喜乐。"],
  ["龙龙致上", "寒辞冬雪，暖带春风，岁华新至，除夕乐融。子丑岁连，全家合欢，觥筹交盏，围炉守岁并华年。遥遥之愿，诚与君念，家兴百和，万福骈臻，喜乐平安，诸事顺遂。"],
  ["龙龙致上", "裁雪为画，揉风作诗。愿岁月温柔，点点滴滴成全人间悲喜；愿你毕生欢愉，朝朝暮暮造就星河奔腾。"]
  ["龙龙致上", "愿保兹善，千载为常。欢笑尽娱，乐哉未央。”新的一年，祝你永怀善意，清澈明朗，无忧无虑，平安顺遂，吉祥圆满。"],
  ["龙龙致上", "此时此刻，华灯初上，万家团圆。  新年将至，惟愿山河锦绣、国泰民安。  惟愿和顺致祥、幸福美满。"],
  ["龙龙致上", "新年的曦光微微，欲引惹黎明，于是漫过山川湖泊，南水北山东林西岭，漫过苍山泱水，躲进风里，此后这方天际，万物初醒，万般美好与你环环相扣。"],
  ["龙龙致上", "眉目舒展，等春照面。唯愿新岁平安，康宁颐乐。纵然岁月川流，顺遂无忧。"],
  ["龙龙致上", "光阴急景暗推迁。减绿鬓，损朱颜。利名牵役几时闲。又还惊，一岁圆。劝君今夕不须眠。且满满，泛觥船。大家沈醉对芳筵。愿新年，胜旧年。"],
  ["龙龙致上", "家人闲坐，灯火可亲；新年伊始，万象更新。愿所念之人，平安喜乐；愿所想之事，顺心如意。"],
  ["龙龙致上", "一场雪，压弯了窗外草木的枝丫，一阵风，凝结了透明玻璃上的花。“人歌小岁酒，花舞大唐春。”新的一年，愿你永怀善意，清澈明朗，无忧无虑，平安顺遂，吉祥如意。"],
  ["龙龙致上", "时光飞鸟跃然穿梭，停靠烟火璀璨不休，在盈盈一弯的月亮旁，倒映着旧年的影和无尽波光。春风摇荡，满载着纯挚的祈愿。四季周而复始，愿你我欢愉顺意。"],
  ["龙龙致上", "新的一年，愿你将遇之人皆为挚友，愿你去往之地皆为热土。天高地阔，万事胜意。人海沧沧，顺遂无忧。"],
  ["龙龙致上", "一愿世清平，二愿身强健。三愿临老头，数与君相见。"]
];
